NextFOAM-2407/tutorials/multiphase/icoReactingMultiphaseInterFoam/oxideFormation/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -1 -2 0 0 0 0 ];

internalField   uniform 1e5;

boundaryField
{
    bottomInlet
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    topOutlet
    {
        type            prghTotalPressure;
        p0              $internalField;
        value           $internalField;
    }

    "(left|right|front|back|bottomLeft|bottomRight)"
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
}


// ************************************************************************* //
